benchmarks/frontends/flask/root.log
          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: benchmark.js
     output: pages/flask/root.log

  scenarios: (100.00%) 1 scenario, 30 max VUs, 2m30s max duration (incl. graceful stop):
           * default: 30 looping VUs for 2m0s (gracefulStop: 30s)


running (2m00.0s), 00/30 VUs, 623678 complete and 0 interrupted iterations
default ✓ [======================================] 30 VUs  2m0s

     data_received..................: 1.4 GB 12 MB/s
     data_sent......................: 50 MB  416 kB/s
     http_req_blocked...............: min=687ns    max=2.3ms   avg=1.2µs   med=1.08µs  p(95)=1.64µs  p(99)=2.61µs 
     http_req_connecting............: min=0s       max=1.33ms  avg=7ns     med=0s      p(95)=0s      p(99)=0s     
     http_req_duration..............: min=350.3µs  max=46.65ms avg=5.73ms  med=5.25ms  p(95)=8.56ms  p(99)=10.81ms
       { expected_response:true }...: min=350.3µs  max=46.65ms avg=5.73ms  med=5.25ms  p(95)=8.56ms  p(99)=10.81ms
     http_req_failed................: 0.00%  ✓ 0           ✗ 623678
     http_req_receiving.............: min=10.25µs  max=8.07ms  avg=23.52µs med=22.37µs p(95)=30.67µs p(99)=41.02µs
     http_req_sending...............: min=3.32µs   max=7.87ms  avg=5.32µs  med=4.83µs  p(95)=7.41µs  p(99)=9.92µs 
     http_req_tls_handshaking.......: min=0s       max=0s      avg=0s      med=0s      p(95)=0s      p(99)=0s     
     http_req_waiting...............: min=320.97µs max=46.6ms  avg=5.7ms   med=5.22ms  p(95)=8.53ms  p(99)=10.78ms
     http_reqs......................: 623678 5197.048271/s
     iteration_duration.............: min=379.82µs max=46.78ms avg=5.76ms  med=5.28ms  p(95)=8.59ms  p(99)=10.84ms
     iterations.....................: 623678 5197.048271/s
     vus............................: 30     min=30        max=30  
     vus_max........................: 30     min=30        max=30